In [2]:
import pandas as pd

In [3]:
dados = pd.read_csv('aluguel.csv', sep = ';')

In [5]:
dados.head(10)

,Tipo,Bairro,Quartos,Vagas,Suites,Area,Valor,Condominio,IPTU
0,Quitinete,Copacabana,1,0,0,40,1700.0,500.0,60.0
1,Casa,Jardim Botânico,2,0,1,100,7000.0,NaN,NaN
2,Conjunto Comercial/Sala,Barra da Tijuca,0,4,0,150,5200.0,4020.0,1111.0
3,Apartamento,Centro,1,0,0,15,800.0,390.0,20.0
4,Apartamento,Higienópolis,1,0,0,48,800.0,230.0,NaN
5,Apartamento,Vista Alegre,3,1,0,70,1200.0,NaN,NaN
6,Apartamento,Cachambi,2,0,0,50,1300.0,301.0,17.0
7,Casa de Condomínio,Barra da Tijuca,5,4,5,750,22000.0,NaN,NaN
8,Casa de Condomínio,Ramos,2,2,0,65,1000.0,NaN,NaN
9,Conjunto Comercial/Sala,Centro,0,3,0,695,35000.0,19193.0,3030.0

In [6]:
dados['Valor'].mean()

12952.659715265761

In [7]:
bairros = ['Barra da Tijuca', 'Copacabana', 'Ipanema', 'Leblon', 'Botafogo', 'Flamengo', 'Tijuca']
selecao = dados['Bairro'].isin(bairros)
dados = dados[selecao]

In [8]:
dados['Bairro'].drop_duplicates()

0           Copacabana
2      Barra da Tijuca
16            Botafogo
21              Tijuca
25              Leblon
27             Ipanema
110           Flamengo
Name: Bairro, dtype: object

In [9]:
grupo_bairro = dados.groupby('Bairro')

In [11]:
for bairro, dados in grupo_bairro: 
    print(bairro)

Barra da Tijuca
Botafogo
Copacabana
Flamengo
Ipanema
Leblon
Tijuca

In [12]:

for bairro, dados in grupo_bairro: 
    print('{} -> {}'.format(bairro, dados.Valor.mean()))

Barra da Tijuca -> 9019.593829923273
Botafogo -> 19517.037900874635
Copacabana -> 4509.83453689168
Flamengo -> 6923.4839901477835
Ipanema -> 10456.517689207345
Leblon -> 11052.345060893098
Tijuca -> 2954.6740250183957

In [13]:
grupo_bairro['Valor'].mean()

Bairro
Barra da Tijuca     9019.593830
Botafogo           19517.037901
Copacabana          4509.834537
Flamengo            6923.483990
Ipanema            10456.517689
Leblon             11052.345061
Tijuca              2954.674025
Name: Valor, dtype: float64

In [14]:
grupo_bairro[['Valor', 'Condominio']].mean().round(2)

                    Valor  Condominio
Bairro
Barra da Tijuca   9019.59     3599.17
Botafogo         19517.04     3296.48
Copacabana        4509.83     1211.94
Flamengo          6923.48     1921.29
Ipanema          10456.52     2360.60
Leblon           11052.35     2290.44
Tijuca            2954.67      854.95